# Arquitectura de YOGA-s (Small)

# Parámetros de YOGA-s (Small)
nc: 10  # número de clases (Se ajusta para cada dataset)

# Factores para escalabilidad
depth_multiple: 0.57  # Factor de profundidad según Tabla 2 del artículo
width_multiple: 0.68  # Factor de ancho según Tabla 2 del artículo

# Anchors de YOLO
anchors:
  - [10,13, 16,30, 33,23]  # P3/8 (Objetos pequeños)
  - [30,61, 62,45, 59,119]  # P4/16 (Objetos medianos)
  - [116,90, 156,198, 373,326]  # P5/32 (Objetos grandes)


# Arquitectura del modelo de acuerdo a lo presentado en Figura 2 del artículo

# YOGA Backbone (CSPGhostNet)
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],
   [-1, 1, GhostConv, [128, 3, 2]],
   [-1, 3, CSPGhost, [128]],
   [-1, 1, GhostConv, [256, 3, 2]],
   [-1, 6, CSPGhost, [256]],
   [-1, 1, GhostConv, [512, 3, 2]],
   [-1, 9, CSPGhost, [512]],
   [-1, 1, GhostConv, [1024, 3, 2]],
   [-1, 3, C3Ghost, [1024]],
   [-1, 1, SPPF, [1024, 5]],
  ]

# YOGA Neck (AFF-PANet)
head:
  [[-1, 1, GhostConv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, AFF, [512]],
   [-1, 3, CSPGhost, [512, False]],

   [-1, 1, GhostConv, [256, 1, 1]],     
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], 
   [[-1, 4], 1, AFF, [256]],            
   [-1, 3, CSPGhost, [256, False]],     

   [-1, 1, GhostConv, [256, 3, 2]],
   [[-1, 14], 1, AFF, [256]],           
   [-1, 3, CSPGhost, [512, False]],

   [-1, 1, GhostConv, [512, 3, 2]],
   [[-1, 10], 1, AFF, [512]],
   [-1, 3, CSPGhost, [1024, False]],

   # YOLO HEAD
   [[17, 20, 23], 1, Detect, [nc, anchors]],
  ]